Repository: neos/redirecthandler-ui
Catalog: Resources/Private/Translations/*/Modules.xlf
Languages: de

# module.label
source: Redirects
de: Weiterleitungen

# module.description
source: This module contains the overview of all redirects and allows to add new redirects and edit or delete existing ones.
de: Dieses Modul bietet einen Überblick aller Weiterleitungen und ermöglicht es, neue Weiterleitungen hinzuzufügen, bestehende zu bearbeiten oder zu löschen.

# filter.search
source: Search
de: Suche

# filter.search.placeholder
source: Search for a redirect
de: Nach einer Weiterleitung suchen

# filter.resultsCountSuffix
source: ({0} total results)
de: ({0} Ergebnisse)

# filter.type
source: Type
de: Typ

# filter.type.manual
source: Manual
de: Manuell erstellt

# filter.type.generated
source: Generated
de: Automatisch erstellt

# filter.showDetails
source: Show details
de: Details zeigen

# pagination.position
source: Showing {0}-{1} of {2}
de: Zeige {0}-{1} von {2}

# pagination.noResults
source: No redirects match your search
de: Keine Weiterleitungen passen zu den Suchparametern

# list.neverHit
source: Never hit
de: Niemals aufgerufen

# list.lastHit
source: Last hit was {0}
de: Der letzte Treffer war {0}

# list.action.edit
source: Edit
de: Bearbeiten

# list.action.delete
source: Delete redirect
de: Weiterleitung löschen

# list.action.confirmDelete
source: Delete the redirect "{0}"?
de: Soll die Weiterleitung "{0}" wirklich gelöscht werden?

# list.action.copyPath
source: Copied path to clipboard
de: Der Pfad wurde in die Zwischenablage kopiert

# warning.redirectCreatedWithChanges
source: The redirect from "{0}/{1}" to "/{2}" ({3}) has been created, but there were changes to other redirects!
de: Die Weiterleitung von "{0}/{1}" zu "/{2}" ({3}) wurde erstellt, aber weitere Weiterleitungen wurden automatisch angepasst!

# warning.redirectUpdatedWithChanges
source: The redirect from "{0}/{1}" to "/{2}" ({3}) has been updated, but there were changes to other redirects!
de: Die Weiterleitung von "{0}/{1}" zu "/{2}" ({3}) wurde aktualisiert, aber weitere Weiterleitungen wurden angepasst!

# message.updatedRedirects
source: The following redirects have been updated
de: Die folgenden Weiterleitungen wurden aktualisiert

# message.redirectCreated
source: The redirect from "{0}/{1}" to "/{2}" ({3}) has been created
de: Die Weiterleitung von "{0}/{1}" zu "/{2}" ({3}) wurde erstellt

# message.relatedChanges
source: Related changes:
de: Weitere Änderungen:

# message.redirectUpdated
source: The redirect has been updated
de: Die Weiterleitung wurde aktualisiert

# message.redirectDeleted
source: The redirect from "{0}/{1}" has been deleted
de: Die Weiterleitung von "{0}/{1}" wurde gelöscht

# message.importCsvSuccess
source: The redirects from the CSV file were imported successfully. See the protocol for details.
de: Die Weiterleitungen aus der CSV Datei wurden erfolgreich importiert. Das Protokoll zeigt alle Änderungen.

# message.importCsvSuccessWithErrors
source: The redirects from the CSV file were imported but there were some errors. See the protocol for details.
de: Die Weiterleitungen aus der CSV Datei wurden importiert, aber es gab Fehler. Das Protokoll enthält die Details.

# error.redirectNotValid
source: The redirect is not valid
de: Die Weiterleitung ist nicht gültig

# error.redirectNotDeleted
source: The redirect could not be removed
de: Die Weiterleitung konnte nicht entfernt werden

# error.redirectNotCreated
source: The redirect could not be created
de: Die Weiterleitung konnte nicht erstellt werden

# error.redirectNotUpdated
source: The redirect could not be updated
de: Die Weiterleitung konnte nicht aktualisiert werden

# error.invalidStartDateTime
source: The start datetime is invalid
de: Das Startdatum ist ungültig

# error.invalidEndDateTime
source: The end datetime is invalid
de: Das Enddatum ist ungültig

# error.sameSourceAndTarget
source: The source and target paths cannot be the same
de: Der Quellpfad und der Zielpfad dürfen nicht identisch sein

# error.importCsvFailed
source: An error occurred while reading the csv file content
de: Beim Lesen der CSV Datei ist ein Fehler aufgetreten

# error.importResourceFailed
source: An error occurred while reading the uploaded file
de: Beim Laden der CSV Datei ist ein Fehler aufgetreten

# error.csvFileNotSet
source: You have to select a CSV file to import
de: Eine CSV Datei muss für den Import gewählt werden

# error.importCsvEmpty
source: No entries were found in the CSV file
de: In der CSV Datei konnten keine Einträge gefunden werden

# error.sourceUriPathNotValid
source: The source path doesn't match the expression {0}
de: Der Quellpfad entspricht nicht dem Muster {0}

# host
source: Origin domain
de: Ursprungsdomäne

# host.allDomains.title
source: This redirect applies to all domains
de: Diese Weiterleitung betrifft alle Domains

# host.allDomains
source: All
de: Alle

source: CSV File
de: CSV Datei

# sourceUriPath
source: Source path
de: Quellpfad

# sourceUriPath.help
source: The source uri path is the relative path after the hostname. F.e. "my/subpage" without any leading or trailing slashes or query parameters. Those will be ignored by Neos when checking a url if it needs to be redirected.
de: Der Quellpfad ist der relative Pfad nach dem Hostnamen. Zum Beispiel "meine/unterseite" ohne Schrägstriche am Anfang oder am Ende und keine Parameter. Diese ignoriert Neos, wenn für eine aufgerufene Url geprüft wird, ob eine Weiterleitung erfolgen soll.

# targetUriPath
source: Target uri or path
de: Zielurl oder Pfad

# startDateTime
source: Active from
de: Aktiv ab

# startDateTime.placeholder
source: E.g. 2019-08-30 13:45
de: Z.B. 2019-08-30 13:45

# endDateTime
source: Active until
de: Aktiv bis

# endDateTime.placeholder
source: E.g. 2021-08-30 08:30
de: Z.B. 2021-08-30 08:30

source: Comment
de: Kommentar

# comment.placeholder
source: Campaign for new product
de: Kampagne für das neue Produkt

source: Creator
de: Ersteller

# hitCounter
source: Hits
de: Treffer

# creationDate
source: Created
de: Erstellt

# field.delimiter.label
source: Delimiter
de: Trennzeichen

# field.includeInactiveRedirects.label
source: Include inactive redirects
de: Inaktive Weiterleitungen exportieren

# field.includeGeneratedRedirects.label
source: Include automatically generated redirects
de: Automatisch generierte Weiterleitungen exportieren

# header.importCsvForm
source: Import redirects from a CSV file
de: Weiterleitungen aus einer CSV Datei importieren

# header.importProtocol
source: Import protocol
de: Import Protokoll

# header.editRedirect
source: Edit redirect
de: Weiterleitung bearbeiten

# header.manageRedirects
source: Manage redirects
de: Weiterleitungen verwalten

source: Actions
de: Aktionen

# action.importCsvFile
source: Import redirects from CSV file
de: Weiterleitungen aus einer CSV Datei importieren

# action.create
source: Add redirect
de: Weiterleitung hinzufügen

# action.update
source: Update redirect
de: Weiterleitung aktualisieren

# action.edit
source: Edit redirect
de: Weiterleitung bearbeiten

# action.cancel
source: Cancel
de: Abbrechen

# action.backToList
source: Back to redirect list
de: Zurück zur Weiterleitungsliste

# action.exportCsv
source: Export CSV file
de: CSV Datei exportieren

# action.export
source: Export redirect rules
de: Weiterleitungsregeln exportieren

# action.import
source: Import redirect rules
de: Weiterleitungsregeln importieren

# list.loading
source: Loading…
de: Lädt…

# list.empty
source: There are currently no redirects defined.
de: Bisher wurden keine Weiterleitungen definiert.

# hint.importCsvFile
source: It is recommended to do an export of the existing redirects as CSV and work on that file, before importing again. This way the structure and required columns are already set up.
de: Es wird empfohlen die existierenden Weiterleitungen zu exportieren und an der resultierenden Datei zu arbeiten, bevor Weiterleitungen importiert werden. Auf diese Weise erhält man automatisch die richtige Struktur.

# hint.importGetHelp
source: Get more help.
de: Weitere Unterstützung finden.
